In [1]:
import pandas as pd

In [2]:
data={'name':['Alice','Bob','Charlie'],'age':[1,2,3]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df.head()

      name  age
0    Alice    1
1      Bob    2
2  Charlie    3

In [5]:
df.at[0,'age']=24

In [6]:
df.head()

      name  age
0    Alice   24
1      Bob    2
2  Charlie    3

In [7]:
df.iloc[0,1]=25

In [8]:
df.head()

      name  age
0    Alice   25
1      Bob    2
2  Charlie    3

In [9]:
df.columns

Index(['name', 'age'], dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [11]:
df['age']

0    25
1     2
2     3
Name: age, dtype: int64

In [12]:
df.age

0    25
1     2
2     3
Name: age, dtype: int64

In [14]:
df['height']=[7,9,5]
df.head()

      name  age  height
0    Alice   25       7
1      Bob    2       9
2  Charlie    3       5

In [18]:
df['test']=[2,3,'']
df.head()

      name  age  height test
0    Alice   25       7    2
1      Bob    2       9    3
2  Charlie    3       5

In [19]:
df.isna()

    name    age  height   test
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [20]:
import numpy as np
df['test']=[1,np.nan,5]
df.head()

      name  age  height  test
0    Alice   25       7   1.0
1      Bob    2       9   NaN
2  Charlie    3       5   5.0

In [22]:
df.isna()

    name    age  height   test
0  False  False   False  False
1  False  False   False   True
2  False  False   False  False

In [23]:
df['gender']='male'
df.head()

      name  age  height  test gender
0    Alice   25       7   1.0   male
1      Bob    2       9   NaN   male
2  Charlie    3       5   5.0   male

In [24]:
df.loc[3]=['Hero',42,5,np.nan,'female']
df.head()

      name  age  height  test  gender
0    Alice   25       7   1.0    male
1      Bob    2       9   NaN    male
2  Charlie    3       5   5.0    male
3     Hero   42       5   NaN  female

In [26]:
df.isna()

    name    age  height   test  gender
0  False  False   False  False   False
1  False  False   False   True   False
2  False  False   False  False   False
3  False  False   False   True   False

In [27]:
df.isna().sum()

name      0
age       0
height    0
test      2
gender    0
dtype: int64